In [2]:
import pandas as pd

In [3]:
 df = pd.read_csv('titanic.csv')

In [5]:
df

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [7]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [8]:
df.shape #shape of df

(887, 8)

In [13]:
df.head() #top rows of dataset

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [14]:
df.tail() #bottom rows of dataset

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.00
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.00
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.45
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.00
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.75

In [25]:
df.sample(5, random_state=42) #random state is used to control the randomness in algo and fixes a pattern for the table

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
296,1,1,Mr. Adolphe Saalfeld,male,47.0,0,0,30.5000
682,0,2,Mr. Joseph Philippe Lemercier Laroche,male,25.0,1,2,41.5792
535,0,3,Mr. Samuel Beard Risien,male,69.0,0,0,14.5000
644,1,1,Col. Oberst Alfons Simonius-Blumer,male,56.0,0,0,35.5000
623,0,2,Rev. Charles Leonard Kirkland,male,57.0,0,0,12.3500

In [31]:
df.loc[1, "Age"] = 39.0 #df.loc[row, column]

In [30]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,age
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500,NaN
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,39.0,1,0,71.2833,39.0
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250,NaN
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000,NaN
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500,NaN

In [34]:
df.Age

0      22.0
1      39.0
2      26.0
3      35.0
4      35.0
       ...
882    27.0
883    19.0
884     7.0
885    26.0
886    32.0
Name: Age, Length: 887, dtype: float64

In [38]:
df.loc[df["Age"]>25] #filtering row/horizontal data

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,age
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,39.0,1,0,71.2833,39.0
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250,NaN
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000,NaN
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500,NaN
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583,NaN
...,...,...,...,...,...,...,...,...,...
879,0,2,Mr. Frederick James Banfield,male,28.0,0,0,10.5000,NaN
881,0,3,Mrs. William (Margaret Norton) Rice,female,39.0,0,5,29.1250,NaN
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000,NaN
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000,NaN
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500,NaN

In [37]:
df.loc[df["Age"]>25][['Name','Sex','Age']]

                                                  Name     Sex   Age
1    Mrs. John Bradley (Florence Briggs Thayer) Cum...  female  39.0
2                                Miss. Laina Heikkinen  female  26.0
3          Mrs. Jacques Heath (Lily May Peel) Futrelle  female  35.0
4                              Mr. William Henry Allen    male  35.0
5                                      Mr. James Moran    male  27.0
..                                                 ...     ...   ...
879                       Mr. Frederick James Banfield    male  28.0
881                Mrs. William (Margaret Norton) Rice  female  39.0
882                               Rev. Juozas Montvila    male  27.0
885                               Mr. Karl Howell Behr    male  26.0
886                                 Mr. Patrick Dooley    male  32.0

[506 rows x 3 columns]

In [42]:
df.loc[(df["Age"]>24) & (df["Sex"]=="female")][["Name","Survived","Fare"]]

                                                  Name  Survived     Fare
1    Mrs. John Bradley (Florence Briggs Thayer) Cum...         1  71.2833
2                                Miss. Laina Heikkinen         1   7.9250
3          Mrs. Jacques Heath (Lily May Peel) Futrelle         1  53.1000
8     Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson         1  11.1333
11                             Miss. Elizabeth Bonnell         1  26.5500
..                                                 ...       ...      ...
867    Mrs. Richard Leonard (Sallie Monypeny) Beckwith         1  52.5542
870               Mrs. Samuel (Hannah Wizosky) Abelson         1  24.0000
875       Mrs. Thomas Jr (Lily Alexenia Wilson) Potter         1  83.1583
876        Mrs. William (Imanita Parrish Hall) Shelley         1  26.0000
881                Mrs. William (Margaret Norton) Rice         0  29.1250

[170 rows x 3 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [6]:
df.drop(columns='Sex')

,Survived,Pclass,Name,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,35.0,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,32.0,0,0,7.7500